{"data":{"markdownRemark":{"frontmatter":{"title":"iOS Inspector Troubleshoot","date":"Feb 22nd, 2018","image":"https://i.imgur.com/2i0w2l3.jpg","intro":"Having problems with your iOS device disconnecting when your trying to inspect with Safari? in this post we list what could be the cause and how to fix it."},"html":"<p>One great thing about testing browser based apps or websites on the iPhone or iPad is that you can inspect it using Safari inspector.</p>\n<h2>Getting started</h2>\n<ol>\n<li>\n<p>In OSX open Safari and go to <strong>\"Safari > preferences > advanced\"</strong> and tick <strong>\"Show develop menu in menu bar\"</strong>.</p>\n</li>\n<li>\n<p>In iOS go to <strong>\"Settings > Safari > Advanced\"</strong> and turn on web inspector.</p>\n</li>\n<li>\n<p>Inspect your device by plugging it in to your mac and going to <strong>\"Develop > your-device-name\"</strong> in the toolbar.</p>\n</li>\n</ol>\n<h2>The problem</h2>\n<p>Unfortunately if you do this for some time you will undoubtably run in to an issue where you go to inspect the device then safari disconnects from it (no longer in the menu).</p>\n<p>{% include article-adsense.html %}</p>\n<p>You may have tried to restart Safari or re-plugin the device, however this doesn't always work.\nIn this article I talk about several methods that I have tried to remedy this problem.</p>\n<ol>\n<li>\n<p>Update both OSX and iOS versions of Safari\nI have found after having the latest of both versions it started working, this could be down to debugging incompatibilities between safari versions.</p>\n</li>\n<li>\n<p>Check that web inspector in iOS is enabled,\nit has been known that this setting can be switched off after an upgrade or perhaps your testing on a different device and forgot to enable it.\nOn your iOS device check in <strong>\"settings > safari > advanced > web inspector\"</strong> and make sure it's enabled.</p>\n</li>\n<li>\n<p>Check the port you are connected to\nI have had mine plugged into a cheap hub / via apple keyboard / monitor hub and found that going directly into the mac is much more reliable.</p>\n</li>\n<li>\n<p>Are you using a good quality cable?\nBetter quality / official cables that aren't worn out have better reliability when in debug, I have experienced moving a bad cable around and it disconnecting/connecting in Safari.</p>\n</li>\n<li>\n<p>Other notable observations\nOther people have commented that making sure cookies are enabled in safari, enabling private mode and trying whilst Xcode is open have affected the reliability of this, although I haven't seen this myself it may help others to try.</p>\n</li>\n</ol>\n<p>Being able to inspect your device in Safari is a great tool but it can be frustrating when it doesn't work as expected, hopefully some of the tips above will work for you and you will spend less time debugging debugging!</p>"}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"fix-safari-web-inspector-disconnecting"}}