{"data":{"markdownRemark":{"frontmatter":{"title":"Styling Input Range","date":"Feb 4th, 2018","image":"./styling-input-range-LG.jpg","intro":"HTML5 input range fields are great but they looks different in every browser, in this post we style them to be uniform across browsers."},"html":"<p>The range input was introduced in HTML5 but the style differs wildly between browsers in this post I will talk about how to style this element to look the same in all modern browsers.\nThe idea is to have a friendly looking range input and label that responds to the users input, the user gets updated feedback on focus, hover, and change.</p>\n<pre><code class=\"language-html\">&#x3C;div class=\"rangeWrapper\">\n  &#x3C;div class=\"label\">\n    &#x3C;span>Range &#x3C;/span>\n    &#x3C;output id=\"rangeoutput\">0&#x3C;/output>\n  &#x3C;/div>\n  &#x3C;input\n    id=\"rangeinput\"\n    type=\"range\"\n    value=\"0\"\n    min=0\n    max=100\n    oninput=\"rangeoutput.value = value\"\n  />\n&#x3C;/div>\n</code></pre>\n<p>Here is my markup it is a wrapper thats contains a label div with an output container as a child and an input of type range.\nThe output element can be used to display the value of the range input by using the <code>oninput</code> attribute on the input element and using the id of the output element, in this case <code>rangeoutput.value = value</code>.\nYou can also use the \"onchange\" attribute the same way but the downside to this is that it only updates when the user has released the slider, this means the user can’t see the current value whilst dragging, choose the best one for your use case.</p>\n<p>{% include article-adsense.html %}</p>\n<p>In order to style the range input first you must remove the default browser styles, this is done with <code>appearance: none;</code> on <code>input[type=“range”]</code>, you may need to add browser prefixes for older/unsupported browsers.</p>\n<pre><code class=\"language-css\">.rangeWrapper {\n  position: relative;\n  width: 80%;\n  margin: auto;\n}\n\n.label {\n  font-family: sans-serif;\n  font-size: 1.5em;\n  color: #388E3C;\n  line-height: 2em;\n}\n\ninput[type=\"range\"] {\n  appearance: none;\n  -webkit-appearance: none;\n  -moz-appearance: none;\n  -ms-appearance: none;\n  width: 100%;\n  height: 25px;\n  padding: 3px;\n  border-radius: 15px;\n  background-color: #388E3C;\n  transition: background-color 0.25s ease;\n  outline: none;\n}\n</code></pre>\n<p>This will make the component invisible but it's still there, now you just need to add your custom styles!\nStart by giving it 100% width, some height and a background-color, I have also added border radius.\nWe also want to animate the range track depending on whether its focused or being hovered upon, using css transitions you can easily apply these styles, I have added <code>transition: background-color 0.25s ease;</code> this will animate the track color when it changes.</p>\n<pre><code class=\"language-css\">input[type=\"range\"]:hover {\n  background-color: #4CAF50;\n}\n\ninput[type=\"range\"]:active {\n  background-color: #81C784;\n}\n</code></pre>\n<p>I have set the background color of the track to be lighter on hover and even lighter on active, I like this effect as it feels like the element is waking up as you hover and awake as you use it before going back to sleep again.</p>\n<p>Now for the range 'thumb' this is the part that moves along the track, to style this you have to use some vender prefixes.\nGoing forward I will be using the <code>-webkit</code> prefix for examples but don't forget to add <code>-moz</code> &#x26; <code>-ms</code>, look at the jsbin example for the full code.</p>\n<pre><code class=\"language-css\">input[type=\"range\"]::-webkit-slider-thumb {\n  appearance: none;\n  -webkit-appearance: none;\n  width: 25px;\n  height: 25px;\n  background-color: white;\n  border-radius: 25px;\n  cursor: move;\n  transition: all 0.15s ease;\n}\n</code></pre>\n<p>I've just Made a simple white circle for the thumb but you can do almost anything here even have a background image to add texture.\nThis does look a little boring though so to make it more interesting I've added some animations on <code>:hover</code> &#x26; <code>:active</code>.</p>\n<pre><code class=\"language-css\">input[type=\"range\"]::-webkit-slider-thumb:hover {\n  height: 30px;\n  width: 30px;\n  box-shadow: 0px 0px 8px 0px rgba(0,0,0,0.5);\n  -webkit-box-shadow: 0px 0px 8px 0px rgba(0,0,0,0.5);\n}\n\ninput[type=\"range\"]::-webkit-slider-thumb:active {\n  height: 35px;\n  width: 35px;\n  box-shadow: 0px 0px 8px 0px rgba(0,0,0,0.5);\n  -webkit-box-shadow: 0px 0px 8px 0px rgba(0,0,0,0.5);\n}\n</code></pre>\n<p>I have animated the size of the thumb as well as increase the shadow, this gives the effect that it's rising to your finger/cursor when you interact with it.</p>\n<p>Using whats shown here you can quickly theme and customise the range input so that it blends in with your website or apps UI without writing a single line of javascript!.</p>"}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"styling-input-range"}}