{"data":{"markdownRemark":{"frontmatter":{"title":"10 Things a Front End Developer Should Know in Terminal","date":"May 14th, 2018","image":{"childImageSharp":{"fluid":{"src":"/static/dda617eaf298fc686c128eee1e7047b0/bc3a8/front-end-terminal.jpg","srcSet":"/static/dda617eaf298fc686c128eee1e7047b0/d278e/front-end-terminal.jpg 200w,\n/static/dda617eaf298fc686c128eee1e7047b0/8539d/front-end-terminal.jpg 400w,\n/static/dda617eaf298fc686c128eee1e7047b0/bc3a8/front-end-terminal.jpg 800w,\n/static/dda617eaf298fc686c128eee1e7047b0/81ef8/front-end-terminal.jpg 1200w,\n/static/dda617eaf298fc686c128eee1e7047b0/f6605/front-end-terminal.jpg 1248w","tracedSVG":"data:image/svg+xml,%3csvg xmlns='http://www.w3.org/2000/svg' width='400' height='109'%3e%3cpath d='M0 55v54h401V0H0v55m177-26v23l1 11h45V41l-1-23-23-1h-22v12' fill='%23d3d3d3' fill-rule='evenodd'/%3e%3c/svg%3e","aspectRatio":3.6705882352941175}}}},"html":"<p>Many front end developers shy away from the command line preferring GUI alternatives however it's now a common requirement in the workplace, here are 10 things every front end developer should know in terminal.</p>\n<p>The command line can seem very intimidating to a new user and some developers will keep it at and arms distance because it conjures up images of movies such as the Matrix, streams of glowing green code that only computers and \"the one\" dare try to understand. The reality however is rather anti-climatic as after you learn some commands it becomes a civilised tool which can liberate you from sometimes clunky and bloated GUI tools.\nThis is by no means an exhaustive list of things front end developers should know on the command line but it is a good starting point and will make several areas of your development workflow smoother as well as being able to communicate with other command line users</p>\n<p><strong>These are commands are for macOS users but should also work for Linux, if you are a windows user the same concepts still apply but the commands will differ.</strong></p>\n<h2>Navigation</h2>\n<p>Most commands you run in terminal are going to involve a path to a specific file or directory but you won't always know where what you're looking for is so you often need to navigate your filesystem to seek out a file.</p>\n<table>\n<thead>\n<tr>\n<th>Command</th>\n<th align=\"center\">Summary</th>\n<th align=\"center\">Example</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>cd</td>\n<td align=\"center\">Changes directory to the provided path.</td>\n<td align=\"center\">cd sites/my-awesome-site</td>\n</tr>\n<tr>\n<td>pwd</td>\n<td align=\"center\">Shows you the path of the working directory.</td>\n<td align=\"center\">pwd</td>\n</tr>\n<tr>\n<td>ls</td>\n<td align=\"center\">Lists contents of current directory or provided path.</td>\n<td align=\"center\">ls sites</td>\n</tr>\n</tbody>\n</table>\n<h2>Creation</h2>\n<p>Creating files and folders is a breeze using the command line, just a few commands can flesh out a new project structure, say goodbye to right clicking in finder or your IDE.</p>\n<table>\n<thead>\n<tr>\n<th>Command</th>\n<th align=\"center\">Summary</th>\n<th align=\"center\">Example</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>touch</td>\n<td align=\"center\">Creates a file</td>\n<td align=\"center\">touch index.html</td>\n</tr>\n<tr>\n<td>mkdir</td>\n<td align=\"center\">Creates a directory</td>\n<td align=\"center\">mkdir assets</td>\n</tr>\n</tbody>\n</table>\n<p>With these commands you can pass though multiple names to create several directories/files at once,\nfor example:</p>\n<pre><code>mkdir my-site\ncd my-site\nmkdir styles scripts images\ntouch index.html\n</code></pre>\n<h2>Move, Copy, Rename</h2>\n<p>Dragging and dropping files in the wrong place by mistake happens to me more than I care to admit but because these commands specify a path you can be sure you always know where they came from and where they're going.</p>\n<table>\n<thead>\n<tr>\n<th>Command</th>\n<th align=\"center\">Summary</th>\n<th align=\"center\">Example</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>mv</td>\n<td align=\"center\">Moves a file or changes its name.</td>\n<td align=\"center\">mv file1.txt dir2/file2.txt</td>\n</tr>\n<tr>\n<td>cp</td>\n<td align=\"center\">Copies from one location to another.</td>\n<td align=\"center\">cp documents/file.txt desktop/file.txt</td>\n</tr>\n</tbody>\n</table>\n<p>The <code>mv</code> command also doubles up as a way to rename a file for example:</p>\n<pre><code>mv myblogpostpage.html blog.html\n</code></pre>\n<h2>Deletion</h2>\n<p>Warning! do not pass trash go straight to remove.\nThese commands may not behave as you'd expect as it does not move the item to the trash but instead removes it straight away!</p>\n<p>This is one of those that's good to know but not always good to use especially when your new and may be pasting commands into terminal you don't entirely understand.</p>\n<table>\n<thead>\n<tr>\n<th>Command</th>\n<th align=\"center\">Summary</th>\n<th align=\"center\">Example</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>rm</td>\n<td align=\"center\">Deletes file at path.</td>\n<td align=\"center\">rm sites/old.css</td>\n</tr>\n<tr>\n<td>rmdir</td>\n<td align=\"center\">Deletes directory at path.</td>\n<td align=\"center\">rmdir old-photos</td>\n</tr>\n<tr>\n<td>rm -R</td>\n<td align=\"center\">Delete that folder, any sub-folders and files it contains.</td>\n<td align=\"center\">rm -R my-old-site</td>\n</tr>\n</tbody>\n</table>\n<h2>Modification</h2>\n<p>This is a tricky subject as some people actually prefer coding on the command line using programs like vim and emacs, I however do prefer to use a GUI based text editor for coding and for the context of this blog post modifying files in the terminal is mainly focused on quickly modifying text based documents where a more capable tool isn't required for example updating a config file, making a typo correction or adding small amount of content.</p>\n<p>There are many options for modifying text based files but I find the most user friendly is called nano, it comes preinstalled and has command hints at the bottom. Nano is a very basic editor compared to others which is exactly what makes it great for n00bs.</p>\n<p>To create or open an existing file just call nano followed by the filename.</p>\n<p><code>nano filename.txt</code></p>\n<p>You will then be able to type in the file, when your done press \"ctrl x\" if will then ask if you want to save the file \"save Y/N?\" type \"Y\" or \"N\" accordingly, if you chose the former it will ask you for the filename defaulting to the one provided, once your happy just press enter.</p>\n<p>{% include article-adsense.html %}</p>\n<h2>Opening</h2>\n<p>Not much to be said here, open a file or files.\nI commonly <code>cd</code> into a project and run <code>open . -a atom</code> to open my project inside the atom text editor.</p>\n<table>\n<thead>\n<tr>\n<th>Command</th>\n<th align=\"center\">Summary</th>\n<th align=\"center\">Example</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>open</td>\n<td align=\"center\">Opens file at path using default application.</td>\n<td align=\"center\">open cv.doc</td>\n</tr>\n<tr>\n<td>open -a</td>\n<td align=\"center\">Opens file at path using specified application.</td>\n<td align=\"center\">open index.html -a firefox</td>\n</tr>\n</tbody>\n</table>\n<h2>Git</h2>\n<p>Git is one of the most important tools for a developer as it enables you to version control and collaborate with other developers effectively. I'm not going to rant about why you should be using git here but it is hands down he most crucial tool to manage code as a front end developer.</p>\n<p>The most common way to interact with git is to install and use the cli, the most common commands are:</p>\n<table>\n<thead>\n<tr>\n<th>Command</th>\n<th align=\"center\">Summary</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>git clone</td>\n<td align=\"center\">Clone an existing repository.</td>\n</tr>\n<tr>\n<td>git init</td>\n<td align=\"center\">Initialise the working directory as a git project.</td>\n</tr>\n<tr>\n<td>git add</td>\n<td align=\"center\">Add files to staging area.</td>\n</tr>\n<tr>\n<td>git commit -m</td>\n<td align=\"center\">Commit the staged files to the branch with a message.</td>\n</tr>\n<tr>\n<td>git push</td>\n<td align=\"center\">Push commits to the remote branch.</td>\n</tr>\n<tr>\n<td>git status</td>\n<td align=\"center\">Display current directory state and staging area.</td>\n</tr>\n<tr>\n<td>git log</td>\n<td align=\"center\">Displays the commit log.</td>\n</tr>\n</tbody>\n</table>\n<h2>Yarn</h2>\n<p>Yarn is a dependancy management tool built on top of npm which stands for \"node package manager\". As the name suggests it manages packages of javascript code that your project depends on.\nYarn is faster and better at managing dependancies across different environments and is an \"out of the box\" replacement for npm.</p>\n<table>\n<thead>\n<tr>\n<th>Command</th>\n<th align=\"center\">Summary</th>\n</tr>\n</thead>\n<tbody>\n<tr>\n<td>yarn init</td>\n<td align=\"center\">Interactively creates or updates a package.json file.</td>\n</tr>\n<tr>\n<td>yarn install</td>\n<td align=\"center\">Installs dependancies.</td>\n</tr>\n<tr>\n<td>yarn add</td>\n<td align=\"center\">Adds a dependancy on a package.</td>\n</tr>\n<tr>\n<td>yarn remove</td>\n<td align=\"center\">Removes a dependancy on a package.</td>\n</tr>\n<tr>\n<td>yarn upgrade</td>\n<td align=\"center\">Updates a dependancy.</td>\n</tr>\n<tr>\n<td>yarn run</td>\n<td align=\"center\">Runs a defined package script.</td>\n</tr>\n</tbody>\n</table>\n<h2>SSH</h2>\n<p>It's very common to access a remote server to transfer files, the ssh command allows you to connect and authenticate with a remote host. You can then execute commands on the server directly from your local machine's terminal.</p>\n<p>To establish a connection you simply need to specify the correct ip address or url. The first time you connect to a new server there will be some form of authentication.</p>\n<pre><code class=\"language-bash\">ssh username@remote_host\n</code></pre>\n<h2>Writing shell scripts</h2>\n<p>Sometimes in your work flow you can find yourself repeating a lot of commands or stringing several commands together to perform a particular task.\nThis can disrupt you or make the work tedious, instead you can make shell scripts that contain repetitive tasks and then execute them.</p>\n<p>The most simple way to do this is to create a shell script file with the extension '.sh' and type your commands into it.</p>\n<p>Next you need to give it the executable permission <code>chmod +x ./yourscript.sh</code>.\nYou can then run it by typing the path into the command line <code>./yourscript.sh</code>.</p>\n<p>A word of warning, do not execute script that you do not know the contents or source of.</p>\n<h2>Conclusion</h2>\n<p>If you're a front end developer that shies away from the command line or uses it very little you are missing out and frankly being left behind, it can increase productivity and open up a plethora of tools to empower your development.</p>"}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"10-things-a-front-end-developer-should-know-in-terminal"}}