{"data":{"markdownRemark":{"frontmatter":{"title":"Moving to Gatsby from Jekyll","date":"May 6th, 2019","image":{"childImageSharp":{"fluid":{"src":"/static/311f829aa82a28b53c3cdc5666c2fb01/bc3a8/gatsby-from-jekyll-header-LG.jpg","srcSet":"/static/311f829aa82a28b53c3cdc5666c2fb01/d278e/gatsby-from-jekyll-header-LG.jpg 200w,\n/static/311f829aa82a28b53c3cdc5666c2fb01/8539d/gatsby-from-jekyll-header-LG.jpg 400w,\n/static/311f829aa82a28b53c3cdc5666c2fb01/bc3a8/gatsby-from-jekyll-header-LG.jpg 800w,\n/static/311f829aa82a28b53c3cdc5666c2fb01/81ef8/gatsby-from-jekyll-header-LG.jpg 1200w,\n/static/311f829aa82a28b53c3cdc5666c2fb01/f6605/gatsby-from-jekyll-header-LG.jpg 1248w","tracedSVG":"data:image/svg+xml,%3csvg xmlns='http://www.w3.org/2000/svg' width='400' height='109'%3e%3cpath d='M0 55v54h401V0H0v55m179-37l-11 29c-5 11-5 12-2 14 4 5 7 2 13-13l9-24c1-3 1-5-2-5v1c3 2 1 2-3 0-3-1-3-1-1-2 1-1 1-1-1-1l-2 1m37 6c-5 2-10 8-10 11l11 12c12 13 12 13 19 6 4-3 6-8 6-12l-6-1c-5 0-6 0-6 2l4 2 4 1-2 3-5 5-2 1-10-9c-9-9-9-10-8-12 3-7 14-9 21-5 5 4 8 3 4-1-4-5-13-6-20-3m-36 12l-3 1-4 2c-2 3-7 16-7 19s2 4 4 3 12-25 11-26l-1 1m25 6c0 7 8 15 15 16h4l-9-8c-9-9-10-10-10-8' fill='%23d3d3d3' fill-rule='evenodd'/%3e%3c/svg%3e","aspectRatio":3.6705882352941175,"sizes":"(max-width: 800px) 100vw, 800px"}}}},"htmlAst":{"type":"root","children":[{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"I talk about why I decided to move idesignpixels.com from a static jekyll site to a static gatsby site and why you may also want to."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h2","properties":{},"children":[{"type":"text","value":"The goal"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"I had been wanting to have a creative outlet to to share some of my discoveries and journeys whilst working as a front end dev, about 4 years ago I started working professionally and was very fortunate to be in a position to try and explore many new and emerging frameworks, view libraries and tools.\nI learned among many other things polymer, angular, react, vue, meteor, ionic, node, mongodb, express, drupal and wordpress.\nI really wanted to get this site up and running but had a major option paralysis and would frequently change my mind on how i was going to approach this depending on what I was learning at the time."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h2","properties":{},"children":[{"type":"text","value":"Why I chose Jekyll"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Eventually I came across Jekyll from seeing some other peoples blogs, after some research it was very straight forward and easy to setup and took much of the thinking out of what tools to use and simply got the content out there."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"I decided to go ahead with Jekyll and got the site up and running pretty quickly, don't get me wrong there were some problems and restrictions around this approach but finally the end goal was clear and more importantly in sight."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"I wrote some initial posts and gradually added to them all whilst continuing my full time developer job, still learning but also starting to find out my own preferences.\nI didn't know it at the time of creating the Jekyll site but I would start to have a strong preference and working relationship with React and it's flexibility that lends itself to continually evolve and stay relatively simple."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"element","tagName":"adsense","properties":{},"children":[]}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"When I start new projects I like to try and use something new each time, fast forward a year or so and one particular react project I was starting needed strong SEO, React and SEO has been a shadowy subject where most solutions seemed too heavy, came with consequences or too new and emerging to invest in. During a conversation with a co-worker Gatsby was mentioned while we talked about potentially server rendering the React application, although we'd never used it before I decided to spend some time checking it out."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"After some initial skepticism thinking it was just a way to render your application server side I was pleasantly surprised as it also uses graphQL to communicate with data sources, I had build some apps that interacted with a headless CMS in the past and it was often a little painful and at least a little too much work than I wanted to do in my spare time with this site."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"The more I explored using markdown and Contentful data sources with Gatsby I saw how simple it was to implement, how little maintenance it needed and best of all I had the freedom of react components to take control of UI how I wanted, not easily done with Jekyll."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"I decided as The title f this post suggests to Move to Gatsby from Jekyll for these reasons and for the most part it was really simple and easy, I decided to build from the ground up but keep the same simple design as before and continuing to use markdown as a source for the posts."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h2","properties":{},"children":[{"type":"text","value":"Conclusion"}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"I have no ill feeling towards Jekyll I always knew it was a simple tool for rapid development and it served its purpose for me but it was time to have more control using the tools I love."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"Should you move from Jekyll to Gatsby?\nWell that really depends on if you're comfortable with React, if you are I think you'll enjoy the flexibility it has as it gives you the best of Jekyll and React in one as well as some really cool features like transforming data with graphQl and handling image loading like a pro with a single query line."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"h2","properties":{},"children":[{"type":"text","value":"One more thing..."}]},{"type":"text","value":"\n"},{"type":"element","tagName":"p","properties":{},"children":[{"type":"text","value":"As I mentioned before I always like to try something new with every new project and this was no exception, I've been putting off css grids for awhile as professionally it seemed a little too risky having limited browser support but now most modern browsers support the css grid spec and I went ahead and started adding it to this site.\nI have used it on the main layout structure and a few components and will continue adding it in other areas in the future and write some posts detailing my findings but so far I'm very impressed! more soon..."}]}],"data":{"quirksMode":false}}}},"pageContext":{"isCreatedByStatefulCreatePages":false,"slug":"moving-to-gatsby-from-jekyll"}}